## Data Cleaning and Preparation

In [3]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Miaasindg Data

In [4]:
string_data = pd.Series(['aardvark','artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [15]:
df.dropna()

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling In Nissing Data

In [18]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [20]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [23]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [24]:
df = pd.Series([1.,NA, 3.5, NA, 7])
data.fillna(data.mean())

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

## DataTransformation
### Removing Duplicates

In [25]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [30]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [42]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [44]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [45]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing values

In [46]:
data = pd.Series([1.,-999., 2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [53]:
data =pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio','Colorado','New York'],
                    columns = ['one','two','three','four'])

In [55]:
transform = lambda x :x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [56]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [57]:
data.rename (index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [58]:
data.rename(index={'Ohio':'INDIANA'}, inplace=True)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### dISCRETIZATION AND Binning

In [59]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [60]:
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [62]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [65]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [66]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.024, 0.24], (0.68, 0.9], (0.68, 0.9], (0.024, 0.24], (0.46, 0.68], ..., (0.24, 0.46], (0.46, 0.68], (0.24, 0.46], (0.68, 0.9], (0.024, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.024, 0.24] < (0.24, 0.46] < (0.46, 0.68] < (0.68, 0.9]]

In [67]:
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats
pd.value_counts(cats)

(0.624, 3.928]                   250
(-0.0144, 0.624]                 250
(-0.677, -0.0144]                250
(-2.9499999999999997, -0.677]    250
dtype: int64

In [68]:
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(-0.0144, 1.287], (-2.9499999999999997, -1.191], (-0.0144, 1.287], (-1.191, -0.0144], (-0.0144, 1.287], ..., (-0.0144, 1.287], (-1.191, -0.0144], (-2.9499999999999997, -1.191], (-1.191, -0.0144], (-0.0144, 1.287]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.191] < (-1.191, -0.0144] < (-0.0144, 1.287] < (1.287, 3.928]]

### Detecting and Filtering Outliers

In [69]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001908    -0.054285     0.047983     0.021561
std       0.995740     0.997178     0.997290     1.008698
min      -3.745356    -3.428254    -3.645860    -3.184377
25%      -0.697084    -0.747478    -0.599807    -0.628122
50%      -0.026381    -0.096965     0.052073    -0.019893
75%       0.699046     0.622384     0.750195     0.690847
max       2.735527     3.366626     2.653656     3.525865

In [70]:
col = data[2]
col[np.abs(col)>3]

549   -3.548824
808   -3.645860
Name: 2, dtype: float64

In [71]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
47  -3.399312 -0.974657 -0.685312 -0.645858
65  -0.817649  0.050188  1.951312  3.260383
142 -3.745356 -1.520113 -0.346839 -0.696918
240 -1.341493 -0.293333 -0.242459 -3.056990
264  0.425384 -3.428254 -0.296336 -0.439938
327 -0.085420  0.275144  1.179227 -3.184377
549 -0.150923 -0.362528 -3.548824  1.553205
641  1.397822  3.366626 -2.372214  0.851010
787  0.582317 -0.658090 -0.207434  3.525865
808 -0.080332  0.599947 -3.645860  0.255475

In [72]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000763    -0.054224     0.049178     0.021016
std       0.991922     0.994625     0.993265     1.005456
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.697084    -0.747478    -0.599807    -0.628122
50%      -0.026381    -0.096965     0.052073    -0.019893
75%       0.699046     0.622384     0.750195     0.690847
max       2.735527     3.000000     2.653656     3.000000

In [73]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [74]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([1, 0, 3, 2, 4])

In [75]:
df
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19

In [76]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [79]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10, replace=True)
draws

1    7
1    7
4    4
2   -1
4    4
3    6
1    7
3    6
2   -1
1    7
dtype: int64

### Computing Indicator/Dummy Variables

In [80]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [83]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [84]:
mnames  = ['movie_id','title','genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header = None, names = mnames)
movies[:10]

D:\anaconda\envs\chch4934\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [85]:
all_generes = []
for x in movies.genres:
    all_generes.extend(x.split('|'))
genres = pd.unique(all_generes)

In [86]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [87]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [88]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [89]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [90]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genre_Animation                               1
Genre_Children's                              1
                               ...
Genre_War                                     0
Genre_Musical                                 0
Genre_Mystery                                 0
Genre_Film-Noir                               0
Genre_Western                                 0
Name: 0, Length: 21, dtype: object

In [91]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation
### String Object Methods

In [105]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [106]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [107]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [108]:
'::'.join(pieces)

'a::b::guido'

In [109]:
'guido' in val
val.index(',')
val.find(':')

-1

In [110]:
val.index(':')

ValueError: substring not found

In [111]:
val.count(',')

2

In [112]:
val.replace(',','::')
val.replace(',','')

'ab  guido'

### Regular Expressions

In [113]:
import re
text = 'foo    bar\t baz   \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [116]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [117]:
regex.findall(text)

['    ', '\t ', '   \t']

In [119]:
text = """Dave dave@google.com
Steev steve@gamil.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [120]:
regex.findall(text)

['dave@google.com', 'steve@gamil.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [121]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [122]:
print(regex.match(text))

None

In [123]:
print(regex.sub('REDAXTED', text))

Dave REDAXTED
Steev REDAXTED
Rob REDAXTED
Ryan REDAXTED

In [127]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [129]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [130]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gamil', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [131]:
print(regex.sub(r'Username: \1, Domain:\2, Suffix:\3', text))

Dave Username: dave, Domain:google, Suffix:com
Steev Username: steve, Domain:gamil, Suffix:com
Rob Username: rob, Domain:gmail, Suffix:com
Ryan Username: ryan, Domain:yahoo, Suffix:com

### Vectorized String Functions in pandas

In [145]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [146]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [147]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [148]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [149]:
matches.str.get(1)
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [150]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [151]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS